dturcu/illd_release_tc3x/src/BaseSw/Infra/Sfr/TC33xED/IfxSdmmc_regdef.h
/** \brief ADMA Error Status Register */
typedef struct _Ifx_SDMMC_ADMA_ERR_STAT_Bits
{
    Ifx_UReg_32Bit ADMA_ERR_STATES:2;    /**< \brief [1:0] ADMA Error States - ADMA_ERR_STATES (r) */
    Ifx_UReg_32Bit ADMA_LEN_ERR:1;    /**< \brief [2:2] ADMA Length Mismatch Error States - ADMA_LEN_ERR (r) */
    Ifx_UReg_32Bit reserved_3:5;      /**< \brief [7:3] \internal Reserved */
    Ifx_UReg_32Bit reserved_8:24;     /**< \brief [31:8] \internal Reserved */
} Ifx_SDMMC_ADMA_ERR_STAT_Bits;

/** \brief ADMA3 Integrated Descriptor Address Register - Low */
typedef struct _Ifx_SDMMC_ADMA_ID_LOW_Bits
{
    Ifx_UReg_32Bit ADMA_ID_LOW:32;    /**< \brief [31:0] ADMA Integrated Descriptor Address - ADMA_ID_LOW (rw) */
} Ifx_SDMMC_ADMA_ID_LOW_Bits;

/** \brief ADMA System Address Register Low */
typedef struct _Ifx_SDMMC_ADMA_SA_LOW_Bits
{
    Ifx_UReg_32Bit ADMA_SA_LOW:32;    /**< \brief [31:0] ADMA System Address - ADMA_SA_LOW (rw) */
} Ifx_SDMMC_ADMA_SA_LOW_Bits;

/** \brief Argument register */
typedef struct _Ifx_SDMMC_ARGUMENT_Bits
{
    Ifx_UReg_32Bit ARGUMENT:32;       /**< \brief [31:0] Command Argument - ARGUMENT (rw) */
} Ifx_SDMMC_ARGUMENT_Bits;

/** \brief Auto CMD Status Register */
typedef struct _Ifx_SDMMC_AUTO_CMD_STAT_Bits
{
    Ifx_UReg_16Bit AUTO_CMD12_NOT_EXEC:1;    /**< \brief [0:0] Auto CMD12 Not Executed - AUTO_CMD12_NOT_EXEC (r) */
    Ifx_UReg_16Bit AUTO_CMD_TOUT_ERR:1;    /**< \brief [1:1] Auto CMD Timeout Error - AUTO_CMD_TOUT_ERR (r) */
    Ifx_UReg_16Bit AUTO_CMD_CRC_ERR:1;    /**< \brief [2:2] Auto CMD CRC Error - AUTO_CMD_CRC_ERR (r) */
    Ifx_UReg_16Bit AUTO_CMD_EBIT_ERR:1;    /**< \brief [3:3] Auto CMD End Bit Error - AUTO_CMD_EBIT_ERR (r) */
    Ifx_UReg_16Bit AUTO_CMD_IDX_ERR:1;    /**< \brief [4:4] Auto CMD Index Error - AUTO_CMD_IDX_ERR (r) */
    Ifx_UReg_16Bit AUTO_CMD_RESP_ERR:1;    /**< \brief [5:5] Auto CMD Response Error - AUTO_CMD_RESP_ERR (r) */
    Ifx_UReg_16Bit reserved_6:1;      /**< \brief [6:6] \internal Reserved */
    Ifx_UReg_16Bit CMD_NOT_ISSUED_AUTO_CMD12:1;    /**< \brief [7:7] Command Not Issued By Auto CMD12 Error - CMD_NOT_ISSUED_AUTO_CMD12 (r) */
    Ifx_UReg_16Bit reserved_8:8;      /**< \brief [15:8] \internal Reserved */
} Ifx_SDMMC_AUTO_CMD_STAT_Bits;

/** \brief Block Gap Control Register */
typedef struct _Ifx_SDMMC_BGAP_CTRL_Bits
{
    Ifx_UReg_8Bit STOP_BG_REQ:1;      /**< \brief [0:0] Stop At Block Gap Request - STOP_BG_REQ (rw) */
    Ifx_UReg_8Bit CONTINUE_REQ:1;     /**< \brief [1:1] Continue Request - CONTINUE_REQ (rw) */
    Ifx_UReg_8Bit RD_WAIT_CTRL:1;     /**< \brief [2:2] Read Wait Control (SD Mode only) - RD_WAIT_CTRL (rw) */
    Ifx_UReg_8Bit INT_AT_BGAP:1;      /**< \brief [3:3] Interrupt At Block Gap (SD Mode only) - INT_AT_BGAP (rw) */
    Ifx_UReg_8Bit reserved_4:4;       /**< \brief [7:4] \internal Reserved */
} Ifx_SDMMC_BGAP_CTRL_Bits;

/** \brief 16-bit Block Count register */
typedef struct _Ifx_SDMMC_BLOCKCOUNT_Bits
{
    Ifx_UReg_16Bit BLOCK_CNT:16;      /**< \brief [15:0] 16-bit Block Count - BLOCK_CNT (rw) */
} Ifx_SDMMC_BLOCKCOUNT_Bits;

/** \brief Block Size register */
typedef struct _Ifx_SDMMC_BLOCKSIZE_Bits
{
    Ifx_UReg_16Bit XFER_BLOCK_SIZE:12;    /**< \brief [11:0] Transfer Block Size - XFER_BLOCK_SIZE (rw) */
    Ifx_UReg_16Bit SDMA_BUF_BDARY:3;    /**< \brief [14:12] SDMA Buffer Boundary - SDMA_BUF_BDARY (rw) */
    Ifx_UReg_16Bit reserved_15:1;     /**< \brief [15:15] \internal Reserved */
} Ifx_SDMMC_BLOCKSIZE_Bits;

/** \brief eMMC Boot Control register */
typedef struct _Ifx_SDMMC_BOOT_CTRL_Bits
{
    Ifx_UReg_16Bit MAN_BOOT_EN:1;     /**< \brief [0:0] Mandatory Boot Enable - MAN_BOOT_EN (rw) */
    Ifx_UReg_16Bit reserved_1:6;      /**< \brief [6:1] \internal Reserved */
    Ifx_UReg_16Bit VALIDATE_BOOT:1;    /**< \brief [7:7] Validate Mandatory Boot Enable bit - VALIDATE_BOOT (w) */
    Ifx_UReg_16Bit BOOT_ACK_ENABLE:1;    /**< \brief [8:8] Boot Acknowledge Enable - BOOT_ACK_ENABLE (rw) */
    Ifx_UReg_16Bit reserved_9:3;      /**< \brief [11:9] \internal Reserved */
    Ifx_UReg_16Bit BOOT_TOUT_CNT:4;    /**< \brief [15:12] Boot Ack Timeout Counter Value. - BOOT_TOUT_CNT (rw) */
} Ifx_SDMMC_BOOT_CTRL_Bits;

/** \brief Buffer Data Port Register */
typedef struct _Ifx_SDMMC_BUF_DATA_Bits
{
    Ifx_UReg_32Bit BUF_DATA:32;       /**< \brief [31:0] Buffer Data - BUF_DATA (rw) */
} Ifx_SDMMC_BUF_DATA_Bits;

/** \brief Capabilities 1 Register 0 to 31 */
typedef struct _Ifx_SDMMC_CAPABILITIES1_Bits
{
    Ifx_UReg_32Bit TOUT_CLK_FREQ:6;    /**< \brief [5:0] Timeout Clock Frequency - TOUT_CLK_FREQ (r) */
    Ifx_UReg_32Bit reserved_6:1;      /**< \brief [6:6] \internal Reserved */
    Ifx_UReg_32Bit TOUT_CLK_UNIT:1;    /**< \brief [7:7] Timeout Clock Unit - TOUT_CLK_UNIT (r) */
    Ifx_UReg_32Bit BASE_CLK_FREQ:8;    /**< \brief [15:8] Base Clock Frequency for SD clock - BASE_CLK_FREQ (r) */
    Ifx_UReg_32Bit MAX_BLK_LEN:2;     /**< \brief [17:16] Maximum Block Length - MAX_BLK_LEN (r) */
    Ifx_UReg_32Bit EMBEDDED_8_BIT:1;    /**< \brief [18:18] 8-bit Support for Embedded Device - Embedded_8_BIT (r) */
    Ifx_UReg_32Bit ADMA2_SUPPORT:1;    /**< \brief [19:19] ADMA2 Support - ADMA2_SUPPORT (r) */
    Ifx_UReg_32Bit reserved_20:1;     /**< \brief [20:20] \internal Reserved */
    Ifx_UReg_32Bit HIGH_SPEED_SUPPORT:1;    /**< \brief [21:21] High Speed Support - HIGH_SPEED_SUPPORT (r) */
    Ifx_UReg_32Bit SDMA_SUPPORT:1;    /**< \brief [22:22] SDMA Support - SDMA_SUPPORT (r) */
    Ifx_UReg_32Bit SUS_RES_SUPPORT:1;    /**< \brief [23:23] Suspense/Resume Support - SUS_RES_SUPPORT (r) */
    Ifx_UReg_32Bit VOLT_33:1;         /**< \brief [24:24] Voltage Support 3.3 V - VOLT_33 (r) */
    Ifx_UReg_32Bit VOLT_30:1;         /**< \brief [25:25] Voltage Support 3.0 V - VOLT_30 (r) */
    Ifx_UReg_32Bit VOLT_18:1;         /**< \brief [26:26] Voltage Support 1.8 V - VOLT_18 (r) */
    Ifx_UReg_32Bit SYS_ADDR_64_V4:1;    /**< \brief [27:27] 64-bit System Address Support for V4 - SYS_ADDR_64_V4 (r) */
    Ifx_UReg_32Bit SYS_ADDR_64_V3:1;    /**< \brief [28:28] 64-bit System Address Support for V3 - SYS_ADDR_64_V3 (r) */
    Ifx_UReg_32Bit ASYNC_INT_SUPPORT:1;    /**< \brief [29:29] Asynchronous Interrupt Support (SD Mode only) - ASYNC_INT_SUPPORT (r) */
    Ifx_UReg_32Bit SLOT_TYPE:2;       /**< \brief [31:30] Slot Type - SLOT_TYPE_R (r) */
} Ifx_SDMMC_CAPABILITIES1_Bits;

/** \brief Capabilities Register 32 to 63 */
typedef struct _Ifx_SDMMC_CAPABILITIES2_Bits
{
    Ifx_UReg_32Bit SDR50_SUPPORT:1;    /**< \brief [0:0] SDR50 Support - SDR50_SUPPORT (r) */
    Ifx_UReg_32Bit SDR104_SUPPORT:1;    /**< \brief [1:1] SDR104 Support - SDR104_SUPPORT (r) */
    Ifx_UReg_32Bit DDR50_SUPPORT:1;    /**< \brief [2:2] DDR50 Support - DDR50_SUPPORT (r) */
    Ifx_UReg_32Bit UHS2_SUPPORT:1;    /**< \brief [3:3] UHS-II Support - UHS2_SUPPORT (r) */
    Ifx_UReg_32Bit DRV_TYPEA:1;       /**< \brief [4:4] Driver Type A Support - DRV_TYPEA (r) */
    Ifx_UReg_32Bit DRV_TYPEC:1;       /**< \brief [5:5] Driver Type C Support - DRV_TYPEC (r) */
    Ifx_UReg_32Bit DRV_TYPED:1;       /**< \brief [6:6] Driver Type D Support - DRV_TYPED (r) */
    Ifx_UReg_32Bit reserved_7:1;      /**< \brief [7:7] \internal Reserved */
    Ifx_UReg_32Bit RETUNE_CNT:4;      /**< \brief [11:8] Timer Count for Re-Tuning - RETUNE_CNT (r) */
    Ifx_UReg_32Bit reserved_12:1;     /**< \brief [12:12] \internal Reserved */
    Ifx_UReg_32Bit USE_TUNING_SDR50:1;    /**< \brief [13:13] Use Tuning for SDR50 - USE_TUNING_SDR50 (r) */
    Ifx_UReg_32Bit RE_TUNING_MODES:2;    /**< \brief [15:14] Re-Tuning Modes - RE_TUNING_MODES (r) */
    Ifx_UReg_32Bit CLK_MUL:8;         /**< \brief [23:16] Clock Multiplier - CLK_MUL (r) */
    Ifx_UReg_32Bit reserved_24:3;     /**< \brief [26:24] \internal Reserved */
    Ifx_UReg_32Bit ADMA3_SUPPORT:1;    /**< \brief [27:27] ADMA3 Support - ADMA3_SUPPORT (r) */
    Ifx_UReg_32Bit VDD2_18V_SUPPORT:1;    /**< \brief [28:28] 1.8 V VDD2 Support - VDD2_18V_SUPPORT (r) */
    Ifx_UReg_32Bit reserved_29:1;     /**< \brief [29:29] \internal Reserved */
    Ifx_UReg_32Bit reserved_30:2;     /**< \brief [31:30] \internal Reserved */
} Ifx_SDMMC_CAPABILITIES2_Bits;

/** \brief Clock Control Register */
typedef struct _Ifx_SDMMC_CLC_Bits
{
    Ifx_UReg_32Bit DISR:1;            /**< \brief [0:0] Module Disable Request Bit - DISR (rw) */
    Ifx_UReg_32Bit DISS:1;            /**< \brief [1:1] Module Disable Status Bit - DISS (rh) */
    Ifx_UReg_32Bit reserved_2:30;     /**< \brief [31:2] \internal Reserved */
} Ifx_SDMMC_CLC_Bits;

/** \brief Clock Control Register */
typedef struct _Ifx_SDMMC_CLK_CTRL_Bits
{
    Ifx_UReg_16Bit INTERNAL_CLK_EN:1;    /**< \brief [0:0] Internal Clock Enable - INTERNAL_CLK_EN (rw) */
    Ifx_UReg_16Bit INTERNAL_CLK_STABLE:1;    /**< \brief [1:1] Internal Clock Stable - INTERNAL_CLK_STABLE (r) */
    Ifx_UReg_16Bit SD_CLK_EN:1;       /**< \brief [2:2] SD/eMMC Clock Enable - SD_CLK_EN (rw) */
    Ifx_UReg_16Bit PLL_ENABLE:1;      /**< \brief [3:3] PLL Enable - PLL_ENABLE (rw) */
    Ifx_UReg_16Bit reserved_4:1;      /**< \brief [4:4] \internal Reserved */
    Ifx_UReg_16Bit CLK_GEN_SELECT:1;    /**< \brief [5:5] Clock Generator Select - CLK_GEN_SELECT (rw) */
    Ifx_UReg_16Bit UPPER_FREQ_SEL:2;    /**< \brief [7:6] SDCLK/RCLK Frequency Select - FREQ_SEL (rw) */
    Ifx_UReg_16Bit FREQ_SEL:8;        /**< \brief [15:8] SDCLK/RCLK Frequency Select - FREQ_SEL (rw) */
} Ifx_SDMMC_CLK_CTRL_Bits;

/** \brief Command register */
typedef struct _Ifx_SDMMC_CMD_Bits
{
    Ifx_UReg_16Bit RESP_TYPE_SELECT:2;    /**< \brief [1:0] Response Type Select - RESP_TYPE_SELECT (rw) */
    Ifx_UReg_16Bit SUB_CMD_FLAG:1;    /**< \brief [2:2] Sub Command Flag - SUB_CMD_FLAG (rw) */
    Ifx_UReg_16Bit CMD_CRC_CHK_ENABLE:1;    /**< \brief [3:3] Command CRC Check Enable - CMD_CRC_CHK_ENABLE (rw) */
    Ifx_UReg_16Bit CMD_IDX_CHK_ENABLE:1;    /**< \brief [4:4] Command Index Check Enable - CMD_IDX_CHK_ENABLE (rw) */
    Ifx_UReg_16Bit DATA_PRESENT_SEL:1;    /**< \brief [5:5] Data Present Select - DATA_PRESENT_SEL (rw) */
    Ifx_UReg_16Bit CMD_TYPE:2;        /**< \brief [7:6] Command Type - CMD_TYPE (rw) */
    Ifx_UReg_16Bit CMD_INDEX:6;       /**< \brief [13:8] Command Index - CMD_INDEX (rw) */
    Ifx_UReg_16Bit reserved_14:2;     /**< \brief [15:14] \internal Reserved */
} Ifx_SDMMC_CMD_Bits;

